{
  "backend/main.mo": "Main Motoko actor implementing a dating app backend with profile management, match decisions, messaging (including image support), and photo posts, using access control and blob storage mixins.",
  "backend/migration.mo": "Migration module that upgrades the actor state by adding an optional `image` field (defaulting to null) to all existing messages in the nested message map.",
  "feature_evidence.json": "Feature evidence report mapping three chat image features (upload button, inline display with lightbox, loading/disabled state) to their implementing file `ChatView.tsx` with high confidence.",
  "frontend-file-summaries.txt": "Auto-generated summary document listing short descriptions of every frontend source file, covering pages, components, hooks, and utilities in the React app.",
  "frontend/index.css": "Root CSS file importing Tailwind directives and defining OKLCH-based CSS custom properties for light and dark color themes including sidebar and chart tokens.",
  "frontend/index.html": "Minimal HTML entry point titled 'Match Connect' that mounts the React app into a `#root` div and loads `src/main.tsx` as an ES module.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with routes for landing, browse, matches, profile, messages, chat, and feed pages, and conditionally shows a profile setup modal for new authenticated users.",
  "frontend/src/components/ChatThemePanel.tsx": "Slide-out Sheet panel component for customizing chat appearance, offering preset theme selection with visual previews and font size controls via the `useChatTheme` hook.",
  "frontend/src/components/ChatView.tsx": "Full-featured chat view component that displays a conversation with a partner, supports sending text and image messages (up to 1.5MB), marks messages as read, and applies customizable chat themes.",
  "frontend/src/components/CreatePostForm.tsx": "Form component for creating a photo post with an optional caption, handling image selection (up to 10MB), upload progress tracking, and submission via the createPhotoPost mutation.",
  "frontend/src/components/Layout.tsx": "App shell component providing a sticky header with navigation links (Browse, Matches, Messages, Feed, Profile), Internet Identity login/logout, and a responsive mobile menu.",
  "frontend/src/components/MatchCard.tsx": "Displays a matched user's profile card showing their avatar initial, name, age, bio, and up to three interest tags, fetching data by Principal.",
  "frontend/src/components/ProfileCard.tsx": "Swipeable profile card for the browse/matching flow that shows a user's details and lets the current user like or pass with animated transitions.",
  "frontend/src/components/ProfileForm.tsx": "Form for creating or editing a user profile with fields for display name, age, bio, and a dynamic interests list, saving via the saveCallerUserProfile mutation.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that wraps ProfileForm and is shown on first login to guide new users through initial profile creation.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useChatTheme.ts": "Custom hook that manages per-user chat theme settings (preset themes, custom colors, font size) persisted to localStorage, with resolved color/background values and update callbacks.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context backed by DFINITY's AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including user profiles, match decisions, interests, messages, and photo posts, wrapping actor calls with loading and caching logic.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, defines light/dark CSS custom properties for the design system, and adds entrance animations for chat messages and conversation items.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query and Internet Identity providers wrapping the root App component.",
  "frontend/src/pages/BrowsePage.tsx": "Page component that displays swipeable user profiles for discovery, filtering out the current user and already-matched profiles, with loading and empty-state handling.",
  "frontend/src/pages/FeedPage.tsx": "Displays a social feed of posts from mutual matches, with a PostCard component showing profile info, image, and caption. Includes a dialog for creating new posts and redirects unauthenticated users to the landing page.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with a hero section, feature highlights, and a login/browse CTA button using Internet Identity authentication.",
  "frontend/src/pages/MatchesPage.tsx": "Shows a grid of profiles the authenticated user has liked, fetched from their match list. Redirects unauthenticated users and displays an empty state with a browse prompt if no likes exist.",
  "frontend/src/pages/MessagesPage.tsx": "Lists all conversations with mutual matches, showing avatar, last message, unread count, and timestamp per ConversationItem. Redirects unauthenticated users and displays an empty state if no matches exist.",
  "frontend/src/pages/ProfilePage.tsx": "Profile creation/editing page that loads the authenticated user's existing profile and renders a ProfileForm. Redirects unauthenticated users to the landing page.",
  "frontend/src/utils/chatThemes.ts": "Defines the ChatTheme interface and exports an array of four preset chat themes (Pastel Dream, Night Sky, Sunset Glow, Mint Fresh) with colors, backgrounds, and emoji, plus a default theme.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom OKLCH-based color tokens (including rose, pink, sidebar, chart colors), dark mode support, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata for 'Match Connect', a WhatsApp-style messaging app, tracking existing features (image upload, inline display, loading indicator) and pending feature requests (backend Base64 image payload support) with schema versioning."
}